src/Catalogs/ксКартаКомпетенцийСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ксКартаКомпетенцийСотрудника</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Разработка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ксРазделыКартыКомпетенций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПредметнаяОбластьЕРП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ксРазделыКартыКомпетенций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОпытРаботыСКонфигурациями</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Конфигурации1С</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сертификаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сертификат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ксСертификатыКурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПолучения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КурсыДипломы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ксСертификатыКурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ксКартаКомпетенцийСотрудника/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ЗаполнитьРазделРазработка(Команда) 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",Истина);  
	ПараметрыФормы.Вставить("МножественныйВыбор",Истина); 

	ОткрытьФорму("Справочник.ксРазделыКартыКомпетенций.ФормаВыбора", ПараметрыФормы,Элементы.Разработка);
	
КонецПроцедуры


&НаКлиенте
Процедура ПрограммированиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка) 
	
	Для Каждого ВыбранныйЭлемент ИЗ ВыбранноеЗначение Цикл
		НовСтр = Объект.Разработка.Добавить();
		НовСтр.Раздел = ВыбранныйЭлемент;
	КонецЦикла;
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗаполнитьПредметнаяОбласть(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",Истина);  
	ПараметрыФормы.Вставить("МножественныйВыбор",Истина); 

	ОткрытьФорму("Справочник.ксРазделыКартыКомпетенций.ФормаВыбора", ПараметрыФормы,Элементы.ПредметнаяОбластьЕРП); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметнаяОбластьЕРПОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Для Каждого ВыбранныйЭлемент ИЗ ВыбранноеЗначение Цикл
		НовСтр = Объект.ПредметнаяОбластьЕРП.Добавить();
		НовСтр.Раздел = ВыбранныйЭлемент;
	КонецЦикла;     
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОбучение(Команда) 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",Истина);  
	ПараметрыФормы.Вставить("МножественныйВыбор",Истина); 

	ОткрытьФорму("Справочник.ксСертификатыКурсы.ФормаВыбора", ПараметрыФормы,Элементы.КурсыДипломы);  
	
КонецПроцедуры

&НаКлиенте
Процедура КурсыДипломыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка) 
	
	Для Каждого ВыбранныйЭлемент ИЗ ВыбранноеЗначение Цикл
		НовСтр = Объект.КурсыДипломы.Добавить();
		НовСтр.Курс = ВыбранныйЭлемент;
	КонецЦикла;  
	
КонецПроцедуры

#КонецОбласти
